{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_95", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_95"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_95", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_95", 0, 0, {}]]], "name": "batch_normalization_95"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_95"}, "inbound_nodes": [[["batch_normalization_95", 0, 0, {}]]], "name": "activation_95"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_96", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_95", 0, 0, {}]]], "name": "conv2d_96"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_96", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_96", 0, 0, {}]]], "name": "batch_normalization_96"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_96"}, "inbound_nodes": [[["batch_normalization_96", 0, 0, {}]]], "name": "activation_96"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_97", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_96", 0, 0, {}]]], "name": "conv2d_97"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_97", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_97", 0, 0, {}]]], "name": "batch_normalization_97"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_97"}, "inbound_nodes": [[["batch_normalization_97", 0, 0, {}]]], "name": "activation_97"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_97", 0, 0, {}]]], "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_98", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "conv2d_98"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_98", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_98", 0, 0, {}]]], "name": "batch_normalization_98"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_98"}, "inbound_nodes": [[["batch_normalization_98", 0, 0, {}]]], "name": "activation_98"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_99", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_98", 0, 0, {}]]], "name": "conv2d_99"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_99", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_99", 0, 0, {}]]], "name": "batch_normalization_99"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_99"}, "inbound_nodes": [[["batch_normalization_99", 0, 0, {}]]], "name": "activation_99"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_99", 0, 0, {}]]], "name": "max_pooling2d_6"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_103", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "conv2d_103"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_103", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_103", 0, 0, {}]]], "name": "batch_normalization_103"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_103"}, "inbound_nodes": [[["batch_normalization_103", 0, 0, {}]]], "name": "activation_103"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_101", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "conv2d_101"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_104", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_103", 0, 0, {}]]], "name": "conv2d_104"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_101", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_101", 0, 0, {}]]], "name": "batch_normalization_101"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_104", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_104", 0, 0, {}]]], "name": "batch_normalization_104"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_101"}, "inbound_nodes": [[["batch_normalization_101", 0, 0, {}]]], "name": "activation_101"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_104"}, "inbound_nodes": [[["batch_normalization_104", 0, 0, {}]]], "name": "activation_104"}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_10", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "average_pooling2d_10"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_100", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "conv2d_100"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_102", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_101", 0, 0, {}]]], "name": "conv2d_102"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_105", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_104", 0, 0, {}]]], "name": "conv2d_105"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_106", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["average_pooling2d_10", 0, 0, {}]]], "name": "conv2d_106"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_100", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_100", 0, 0, {}]]], "name": "batch_normalization_100"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_102", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_102", 0, 0, {}]]], "name": "batch_normalization_102"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_105", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_105", 0, 0, {}]]], "name": "batch_normalization_105"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_106", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_106", 0, 0, {}]]], "name": "batch_normalization_106"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_100"}, "inbound_nodes": [[["batch_normalization_100", 0, 0, {}]]], "name": "activation_100"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_102"}, "inbound_nodes": [[["batch_normalization_102", 0, 0, {}]]], "name": "activation_102"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_105"}, "inbound_nodes": [[["batch_normalization_105", 0, 0, {}]]], "name": "activation_105"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_106"}, "inbound_nodes": [[["batch_normalization_106", 0, 0, {}]]], "name": "activation_106"}, {"class_name": "Concatenate", "config": {"trainable": false, "name": "mixed0", "axis": 3}, "inbound_nodes": [[["activation_100", 0, 0, {}], ["activation_102", 0, 0, {}], ["activation_105", 0, 0, {}], ["activation_106", 0, 0, {}]]], "name": "mixed0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_110", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_110"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_110", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_110", 0, 0, {}]]], "name": "batch_normalization_110"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_110"}, "inbound_nodes": [[["batch_normalization_110", 0, 0, {}]]], "name": "activation_110"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_108", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_108"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_111", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_110", 0, 0, {}]]], "name": "conv2d_111"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_108", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_108", 0, 0, {}]]], "name": "batch_normalization_108"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_111", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_111", 0, 0, {}]]], "name": "batch_normalization_111"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_108"}, "inbound_nodes": [[["batch_normalization_108", 0, 0, {}]]], "name": "activation_108"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_111"}, "inbound_nodes": [[["batch_normalization_111", 0, 0, {}]]], "name": "activation_111"}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_11", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_11"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_107", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_107"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_109", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_108", 0, 0, {}]]], "name": "conv2d_109"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_112", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_111", 0, 0, {}]]], "name": "conv2d_112"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_113", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["average_pooling2d_11", 0, 0, {}]]], "name": "conv2d_113"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_107", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_107", 0, 0, {}]]], "name": "batch_normalization_107"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_109", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_109", 0, 0, {}]]], "name": "batch_normalization_109"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_112", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_112", 0, 0, {}]]], "name": "batch_normalization_112"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_113", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_113", 0, 0, {}]]], "name": "batch_normalization_113"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_107"}, "inbound_nodes": [[["batch_normalization_107", 0, 0, {}]]], "name": "activation_107"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_109"}, "inbound_nodes": [[["batch_normalization_109", 0, 0, {}]]], "name": "activation_109"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_112"}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "name": "activation_112"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_113"}, "inbound_nodes": [[["batch_normalization_113", 0, 0, {}]]], "name": "activation_113"}, {"class_name": "Concatenate", "config": {"trainable": false, "name": "mixed1", "axis": 3}, "inbound_nodes": [[["activation_107", 0, 0, {}], ["activation_109", 0, 0, {}], ["activation_112", 0, 0, {}], ["activation_113", 0, 0, {}]]], "name": "mixed1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_117", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_117"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_117", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_117", 0, 0, {}]]], "name": "batch_normalization_117"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_117"}, "inbound_nodes": [[["batch_normalization_117", 0, 0, {}]]], "name": "activation_117"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_115", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_115"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_118", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_117", 0, 0, {}]]], "name": "conv2d_118"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_115", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_115", 0, 0, {}]]], "name": "batch_normalization_115"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_118", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_118", 0, 0, {}]]], "name": "batch_normalization_118"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_115"}, "inbound_nodes": [[["batch_normalization_115", 0, 0, {}]]], "name": "activation_115"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_118"}, "inbound_nodes": [[["batch_normalization_118", 0, 0, {}]]], "name": "activation_118"}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_12", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_12"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_114", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_114"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_116", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_115", 0, 0, {}]]], "name": "conv2d_116"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_119", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_118", 0, 0, {}]]], "name": "conv2d_119"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_120", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["average_pooling2d_12", 0, 0, {}]]], "name": "conv2d_120"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_114", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_114", 0, 0, {}]]], "name": "batch_normalization_114"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_116", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_116", 0, 0, {}]]], "name": "batch_normalization_116"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_119", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_119", 0, 0, {}]]], "name": "batch_normalization_119"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_120", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_120", 0, 0, {}]]], "name": "batch_normalization_120"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_114"}, "inbound_nodes": [[["batch_normalization_114", 0, 0, {}]]], "name": "activation_114"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_116"}, "inbound_nodes": [[["batch_normalization_116", 0, 0, {}]]], "name": "activation_116"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_119"}, "inbound_nodes": [[["batch_normalization_119", 0, 0, {}]]], "name": "activation_119"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_120"}, "inbound_nodes": [[["batch_normalization_120", 0, 0, {}]]], "name": "activation_120"}, {"class_name": "Concatenate", "config": {"trainable": false, "name": "mixed2", "axis": 3}, "inbound_nodes": [[["activation_114", 0, 0, {}], ["activation_116", 0, 0, {}], ["activation_119", 0, 0, {}], ["activation_120", 0, 0, {}]]], "name": "mixed2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_122", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_122"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_122", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_122", 0, 0, {}]]], "name": "batch_normalization_122"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_122"}, "inbound_nodes": [[["batch_normalization_122", 0, 0, {}]]], "name": "activation_122"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_123", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_122", 0, 0, {}]]], "name": "conv2d_123"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_123", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_123", 0, 0, {}]]], "name": "batch_normalization_123"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_123"}, "inbound_nodes": [[["batch_normalization_123", 0, 0, {}]]], "name": "activation_123"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_121", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_121"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_124", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_123", 0, 0, {}]]], "name": "conv2d_124"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_121", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_121", 0, 0, {}]]], "name": "batch_normalization_121"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_124", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_124", 0, 0, {}]]], "name": "batch_normalization_124"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_121"}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "name": "activation_121"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_124"}, "inbound_nodes": [[["batch_normalization_124", 0, 0, {}]]], "name": "activation_124"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "max_pooling2d_7"}, {"class_name": "Concatenate", "config": {"trainable": false, "name": "mixed3", "axis": 3}, "inbound_nodes": [[["activation_121", 0, 0, {}], ["activation_124", 0, 0, {}], ["max_pooling2d_7", 0, 0, {}]]], "name": "mixed3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_129", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_129"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_129", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_129", 0, 0, {}]]], "name": "batch_normalization_129"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_129"}, "inbound_nodes": [[["batch_normalization_129", 0, 0, {}]]], "name": "activation_129"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_130", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [7, 1]}, "inbound_nodes": [[["activation_129", 0, 0, {}]]], "name": "conv2d_130"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_130", "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, 